# PaperSource Properties

---
The PaperSource type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Name|  Retrieve the paper source name of current project.
Top
#### Reference
PaperSource Class
Autodesk.Revit.DB Namespace